import psycopg2


conn = psycopg2.connect(
    user="postgres",
    password="Albert2004",
    host="localhost",
    port="5432"
)

# Создаем курсор
cursor = conn.cursor()


insert_query = '''
INSERT INTO tickets (event_name, type, location, event_time, duration, price)
VALUES (%s, %s, %s, %s, %s, %s);
'''

ticket_data_list = [
    ('Посещение Эрмитажа', "Билет в музей", 'Санкт-Петербург', '2024-11-10 10:00:00', '04:00:00', 800.00),
    ('Посещение музея Прадо', "Билет в музей", 'Мадрид', '2024-12-20 09:30:00', '03:00:00', 1200.00),
    ('Посещение Лувра', "Билет в музей", 'Париж', '2024-11-25 14:00:00', '02:30:00', 1500.00),
    ('Экскурсия по Красной площади', "Экскурсионный Тур", 'Москва', '2024-12-05 11:00:00', '02:00:00', 1000.00),
    ('Экскурсия по Колизею', "Экскурсионный Тур", 'Рим', '2024-10-30 13:00:00', '02:00:00', 2000.00),
    ('Тур по замкам Луары', "Экскурсионный Тур", 'Франция', '2024-10-31 09:00:00', '08:00:00', 5000.00),
    ('Поход в Карпаты', "Билет в поход", 'Украина', '2024-08-15 07:00:00', '12:00:00', 3000.00),
    ('Поход по Алтаю', "Билет в поход", 'Россия', '2024-07-20 06:00:00', '10:00:00', 3500.00),
    ('Поход в Йеллоустон', "Билет в поход", 'США', '2024-06-05 08:00:00', '06:00:00', 4000.00)
]

cursor.executemany(insert_query, ticket_data_list)
conn.commit()

print("Данные успешно добавлены в таблицу.")

# Закрываем курсор и соединение
cursor.close()
conn.close()


